paper/get_set_benchmark/raw/idlekv-get-set-1-9.txt
4         Threads
64        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       725402.92          ---          ---         2.57517         2.06300         8.03100        14.01500     55176.00 
Gets      6528626.27    195088.95   6333537.32         2.57548         2.06300         8.03100        14.01500    254414.40 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    7254029.19    195088.95   6333537.32         2.57545         2.06300         8.03100        14.01500    309590.40 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       0.847        5.000
SET       1.015       10.000
SET       1.135       15.000
SET       1.247       20.000
SET       1.359       25.000
SET       1.471       30.000
SET       1.591       35.000
SET       1.719       40.000
SET       1.871       45.000
SET       2.063       50.000
SET       2.159       52.500
SET       2.271       55.000
SET       2.399       57.500
SET       2.527       60.000
SET       2.655       62.500
SET       2.799       65.000
SET       2.943       67.500
SET       3.103       70.000
SET       3.263       72.500
SET       3.439       75.000
SET       3.519       76.250
SET       3.615       77.500
SET       3.711       78.750
SET       3.807       80.000
SET       3.903       81.250
SET       4.015       82.500
SET       4.127       83.750
SET       4.255       85.000
SET       4.383       86.250
SET       4.511       87.500
SET       4.575       88.125
SET       4.639       88.750
SET       4.735       89.375
SET       4.799       90.000
SET       4.895       90.625
SET       4.991       91.250
SET       5.087       91.875
SET       5.183       92.500
SET       5.279       93.125
SET       5.407       93.750
SET       5.471       94.062
SET       5.535       94.375
SET       5.631       94.688
SET       5.695       95.000
SET       5.791       95.312
SET       5.887       95.625
SET       5.983       95.938
SET       6.079       96.250
SET       6.175       96.562
SET       6.303       96.875
SET       6.399       97.031
SET       6.463       97.188
SET       6.527       97.344
SET       6.623       97.500
SET       6.719       97.656
SET       6.815       97.812
SET       6.911       97.969
SET       7.007       98.125
SET       7.135       98.281
SET       7.295       98.438
SET       7.359       98.516
SET       7.455       98.594
SET       7.551       98.672
SET       7.647       98.750
SET       7.743       98.828
SET       7.871       98.906
SET       7.999       98.984
SET       8.159       99.062
SET       8.319       99.141
SET       8.511       99.219
SET       8.575       99.258
SET       8.703       99.297
SET       8.831       99.336
SET       8.959       99.375
SET       9.087       99.414
SET       9.279       99.453
SET       9.471       99.492
SET       9.599       99.531
SET       9.855       99.570
SET      10.111       99.609
SET      10.239       99.629
SET      10.367       99.648
SET      10.495       99.668
SET      10.623       99.688
SET      10.815       99.707
SET      11.007       99.727
SET      11.199       99.746
SET      11.455       99.766
SET      11.711       99.785
SET      11.967       99.805
SET      12.159       99.814
SET      12.287       99.824
SET      12.479       99.834
SET      12.671       99.844
SET      12.799       99.854
SET      13.055       99.863
SET      13.311       99.873
SET      13.503       99.883
SET      13.759       99.893
SET      14.079       99.902
SET      14.335       99.907
SET      14.591       99.912
SET      14.847       99.917
SET      15.039       99.922
SET      15.231       99.927
SET      15.487       99.932
SET      15.743       99.937
SET      16.063       99.941
SET      16.511       99.946
SET      16.767       99.951
SET      17.023       99.954
SET      17.279       99.956
SET      17.407       99.958
SET      17.663       99.961
SET      17.919       99.963
SET      18.175       99.966
SET      18.431       99.968
SET      18.687       99.971
SET      19.199       99.973
SET      19.455       99.976
SET      19.583       99.977
SET      19.711       99.978
SET      19.839       99.979
SET      19.967       99.980
SET      19.967       99.982
SET      20.223       99.983
SET      20.479       99.984
SET      20.735       99.985
SET      20.991       99.987
SET      21.503       99.988
SET      21.631       99.988
SET      21.887       99.989
SET      22.143       99.990
SET      22.399       99.990
SET      22.783       99.991
SET      22.911       99.991
SET      23.039       99.992
SET      23.423       99.993
SET      23.679       99.993
SET      23.935       99.994
SET      24.063       99.994
SET      24.063       99.995
SET      24.319       99.995
SET      24.319       99.995
SET      24.703       99.995
SET      24.831       99.996
SET      24.831       99.996
SET      24.831       99.996
SET      25.215       99.997
SET      25.599       99.997
SET      25.727       99.997
SET      25.855       99.997
SET      25.983       99.997
SET      26.111       99.998
SET      26.111       99.998
SET      26.367       99.998
SET      26.367       99.998
SET      26.623       99.998
SET      26.879       99.998
SET      27.007       99.998
SET      27.135       99.999
SET      27.263       99.999
SET      27.391       99.999
SET      27.391       99.999
SET      27.519       99.999
SET      27.775       99.999
SET      28.031       99.999
SET      28.159       99.999
SET      28.159       99.999
SET      28.159       99.999
SET      28.287       99.999
SET      28.415       99.999
SET      28.415       99.999
SET      28.415       99.999
SET      28.543       99.999
SET      28.927       99.999
SET      28.927      100.000
SET      28.927      100.000
SET      29.183      100.000
SET      29.183      100.000
SET      29.183      100.000
[...]
SET      29.311      100.000
SET      29.311      100.000
SET      29.311      100.000
[...]
SET      29.567      100.000
SET      29.567      100.000
SET      29.951      100.000
SET      32.639      100.000
SET      32.639      100.000
SET      32.639      100.000
[...]
SET      38.399      100.000
SET      38.399      100.000
SET      38.399      100.000
[...]
SET      38.655      100.000
SET      39.423      100.000
SET      39.423      100.000
SET      39.423      100.000
[...]
SET      39.679      100.000
SET      39.679      100.000
---
GET       0.023        0.000
GET       0.847        5.000
GET       1.015       10.000
GET       1.135       15.000
GET       1.247       20.000
GET       1.359       25.000
GET       1.471       30.000
GET       1.591       35.000
GET       1.719       40.000
GET       1.871       45.000
GET       2.063       50.000
GET       2.159       52.500
GET       2.271       55.000
GET       2.399       57.500
GET       2.527       60.000
GET       2.655       62.500
GET       2.799       65.000
GET       2.943       67.500
GET       3.103       70.000
GET       3.263       72.500
GET       3.439       75.000
GET       3.519       76.250
GET       3.615       77.500
GET       3.711       78.750
GET       3.807       80.000
GET       3.903       81.250
GET       4.015       82.500
GET       4.127       83.750
GET       4.255       85.000
GET       4.383       86.250
GET       4.511       87.500
GET       4.575       88.125
GET       4.639       88.750
GET       4.735       89.375
GET       4.799       90.000
GET       4.895       90.625
GET       4.991       91.250
GET       5.087       91.875
GET       5.183       92.500
GET       5.279       93.125
GET       5.407       93.750
GET       5.471       94.062
GET       5.567       94.375
GET       5.631       94.688
GET       5.695       95.000
GET       5.791       95.312
GET       5.887       95.625
GET       5.983       95.938
GET       6.079       96.250
GET       6.175       96.562
GET       6.303       96.875
GET       6.399       97.031
GET       6.463       97.188
GET       6.527       97.344
GET       6.623       97.500
GET       6.719       97.656
GET       6.815       97.812
GET       6.911       97.969
GET       7.007       98.125
GET       7.135       98.281
GET       7.295       98.438
GET       7.359       98.516
GET       7.455       98.594
GET       7.551       98.672
GET       7.647       98.750
GET       7.743       98.828
GET       7.871       98.906
GET       7.999       98.984
GET       8.159       99.062
GET       8.319       99.141
GET       8.511       99.219
GET       8.575       99.258
GET       8.703       99.297
GET       8.831       99.336
GET       8.959       99.375
GET       9.087       99.414
GET       9.279       99.453
GET       9.471       99.492
GET       9.599       99.531
GET       9.855       99.570
GET      10.111       99.609
GET      10.239       99.629
GET      10.367       99.648
GET      10.495       99.668
GET      10.623       99.688
GET      10.815       99.707
GET      11.007       99.727
GET      11.199       99.746
GET      11.455       99.766
GET      11.711       99.785
GET      11.967       99.805
GET      12.159       99.814
GET      12.287       99.824
GET      12.479       99.834
GET      12.671       99.844
GET      12.799       99.854
GET      13.055       99.863
GET      13.311       99.873
GET      13.503       99.883
GET      13.759       99.893
GET      14.079       99.902
GET      14.335       99.907
GET      14.591       99.912
GET      14.847       99.917
GET      15.039       99.922
GET      15.231       99.927
GET      15.487       99.932
GET      15.743       99.937
GET      16.063       99.941
GET      16.511       99.946
GET      16.767       99.951
GET      17.023       99.954
GET      17.279       99.956
GET      17.407       99.958
GET      17.663       99.961
GET      17.919       99.963
GET      18.175       99.966
GET      18.431       99.968
GET      18.815       99.971
GET      19.199       99.973
GET      19.455       99.976
GET      19.583       99.977
GET      19.711       99.978
GET      19.839       99.979
GET      19.967       99.980
GET      19.967       99.982
GET      20.223       99.983
GET      20.479       99.984
GET      20.735       99.985
GET      21.119       99.987
GET      21.631       99.988
GET      21.759       99.988
GET      21.887       99.989
GET      22.143       99.990
GET      22.399       99.990
GET      22.783       99.991
GET      22.911       99.991
GET      23.039       99.992
GET      23.423       99.993
GET      23.679       99.993
GET      23.935       99.994
GET      24.063       99.994
GET      24.063       99.995
GET      24.319       99.995
GET      24.319       99.995
GET      24.831       99.995
GET      24.831       99.996
GET      24.831       99.996
GET      24.831       99.996
GET      25.343       99.997
GET      25.599       99.997
GET      25.727       99.997
GET      25.855       99.997
GET      25.983       99.997
GET      26.111       99.998
GET      26.111       99.998
GET      26.367       99.998
GET      26.495       99.998
GET      26.751       99.998
GET      26.879       99.998
GET      27.007       99.998
GET      27.135       99.999
GET      27.263       99.999
GET      27.391       99.999
GET      27.391       99.999
GET      27.391       99.999
GET      27.775       99.999
GET      28.031       99.999
GET      28.159       99.999
GET      28.159       99.999
GET      28.159       99.999
[...]
GET      28.287       99.999
GET      28.415       99.999
GET      28.415       99.999
GET      28.543       99.999
GET      28.927       99.999
GET      28.927      100.000
GET      28.927      100.000
GET      29.183      100.000
GET      29.183      100.000
GET      29.183      100.000
GET      29.311      100.000
GET      29.311      100.000
GET      29.311      100.000
[...]
GET      29.567      100.000
GET      29.567      100.000
GET      29.567      100.000
GET      30.207      100.000
GET      32.639      100.000
GET      32.639      100.000
GET      32.639      100.000
[...]
GET      38.399      100.000
GET      38.399      100.000
GET      38.399      100.000
[...]
GET      38.655      100.000
GET      39.423      100.000
GET      39.423      100.000
GET      39.423      100.000
[...]
GET      39.679      100.000
GET      39.679      100.000
---
WAIT      0.000      100.000